# Basic & Utility
brew "yadm"
cask "alfred"
brew "fzf"
brew "ranger"
cask "powershell"
cask "keepassxc"
tap "koekeishiya/formulae"
brew "yabai"
cask "kitty"
tap "FelixKratz/formulae"
brew "sketchybar"
brew "jq"
cask "android-file-transfer"

# Fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-iosevka"

# Text
brew "vim"
brew "marp-cli"
brew "pandoc"
brew "plantuml"

# Web
cask "firefox"

# Programming
brew "node"
brew "yarn"
brew "git"
brew "git-lfs"
tap "microsoft/git"
cask "git-credential-manager"
cask "dbeaver-community"
cask "visual-studio-code"
brew "scrcpy"
brew "openjdk"
brew "openjdk@11"
brew "azure-cli"
cask "ghidra"
cask "hammerspoon"
cask "android-platform-tools"
